[    
    {
        "library_id": "1",
        "question_type": "complete",
        "content": "Bees make honey, and honey is one of the most amazing foods that we can find in nature. Did you know that honey never goes ___61___? They have found honey that is 5, 000 years old and that you can still eat. Honey can help us with a lot of our health problems. <br>A bee colony is a group of bees that live together. Each colony has one mother bee. This queen bee can live for three to five years. She produces up to 2, 000 eggs every day. The other bees make honey ___62___ young bees can eat in the winter. How do they do this? Bees visit lots of flowers and take the pollen （花粉）home. But as they do this, some of the pollen falls off the bees onto other flowers. The plants use this pollen to make new plants. Thirty percent of the world’s crops need bees to live. <br>Unfortunately, bees can sting （刺）you if they think you are trying to ___63___ them. The best thing to do if this happens is to take the stinger out carefully with your fingernail and wash the area with soap and water. Put ice on it for the pain. Some bees die after they sting. Poor bees!<br>here are many good reasons to keep bees yourself. Once you have done that, you will need wooden boxes to keep the bees in. Wooden boxes are very ___64___ to the homes that bees make for themselves in trees. You will also need a jacket and a hat with a piece that covers your face to keep you safe while you are working with the bees. <br>___65___ , you will need a way to make some smoke. When there is smoke near their home, bees can’t “talk” to each other. They start to eat their honey and ___66___ leaving their home, so they will be too busy to sting you. Enjoy your bees, and don’t forget to share your honey with your neighbors!",
        "blanks": [
            {
                "blank_id": "61",
                "correct_word": ["bad"],
                "alternatives": ["crazy", "bad", "fresh", "wrong"]
            },
            {
                "blank_id": "62",
                "correct_word": ["so that"],
                "alternatives": ["so that", "as if", "now that", "even if"]
            },
            {
                "blank_id": "63",
                "correct_word": ["hurt"],
                "alternatives": ["protect", "avoid", "hurt", "attract"]
            },
            {
                "blank_id": "64",
                "correct_word": ["similar"],
                "alternatives": ["similar", "friendly", "unknown", "special"]
            },
            {
                "blank_id": "65",
                "correct_word": ["Finally"],
                "alternatives": ["Basically", "Luckily", "Finally", "Automatically"]
            },
            {
                "blank_id": "66",
                "correct_word": ["think about"],
                "alternatives": ["know about", "hear about", "dream about", "think about"]
            }
        ],
        "info": "【导语】本文主要介绍了蜜蜂的相关知识。<br>【61题详解】<br>句意：你知道蜂蜜永远不会坏吗?<br>crazy疯狂的；bad坏的；fresh新鲜的；wrong错误的。根据后文“They have found honey that is 5, 000 years old and that you can still eat. ”可知蜂蜜不会坏，故选B。<br>【62题详解】<br>句意：其他蜜蜂酿蜜是为了小蜜蜂在冬天可以有吃的。<br>so that以便于；as if似乎，仿佛；now that既然；even if即使。根据“The other bees make honey”与“young bees can eat in the winter”可知后半句是前半句的目的，故选A。<br>【63题详解】<br>句意：不幸的是，如果蜜蜂认为你试图伤害它们，它们就会蛰你。<br>protect保护：avoid避免；hurt伤害；attract吸引。根据前半句“Unfortunately, bees can sting （刺）you”和“if they think you are trying to…them.”可知蜜蜂感觉会被伤害时才会蜇人，故选C。<br>【64题详解】<br>句意：木箱与蜜蜂在树上为自己建造的房子非常相似。<br>similar相似的；friendly友好的；unknown未知的；special特别的。由“Once you have done that, you will need wooden boxes to keep the bees in.”可知木箱是为了养蜂，所以可推测是和蜜蜂原本的环境相似，故选A。<br>【65题详解】<br>句意：最后你需要一种方法来制造一些烟。<br>Basically基本上；Luckily幸运的；Finally最终；Automatically自动的。根据前文“You will also need a jacket and a hat with a piece that covers your face to keep you safe while you are working with the bees.”和后文“you will need a way to make some smoke. When there is smoke near their home, bees can’t ‘talk’ to each other. ”可知这是养蜂的最后一步，即采蜂蜜，需要用做好防护，用烟熏，故选C。<br>【66题详解】<br>句意：它们开始吃蜜，并考虑离开它们的家，这样它们就会太忙了，没有时间蜇你。<br>know about了解；hear about听说；dream about梦见：think about考虑。根据语境及“so they will be too busy to sting you”可知此时蜜蜂被烟熏，应是考虑自保离开家，故选D。",
        "vocabulary_focus": [["bad"],["so that"],["hurt"],["similar"],["Finally"],["think about"]],
        "library_from": ""
    },
    {
    "library_id": "2",
    "question_type": "fill",
    "content": "<img src=\"files/sample.jpg\">Teens worldwide connect through video calls to have communication emotionally. <br>Five years ago, Abhay and a group of his Grade 10 classmates at a secondary school in Canada made their first video call to the Arctic (北极). On the other end of the l___67___ was Abhay’s, a 23-year-old brother, Sukhmeet, a volunteer teaching assistant. His class was at a middle school there. <br>The conversation started with teen’s small talk-asking each other about TV shows, music and school life. But as the teens grew more comfortable, the chat turned s___68___ , such as families issues, stories of social problems. Some kids shared how hopeless they felt, for they could do n___69___ about the danger or threat caused by the climate change. <br>After both groups said their goodbyes, the brothers had an idea: since the conversation was designed to broaden the students’ views about life outside their h___70___, let’s keep it on. Students could continue to benefit from bridging geographical and cultural differences. They called their organization Break The Divide. <br>The students used social media to spread the word about their task to create eye-opening conversations. Other schools began reaching out, and Break The Divide helped them to start their own stations. They p___71___ different useful resources, such as a list of guiding questions to get the conversation started, and technical tips for video calls. Different stations are encouraged to connect with each other based on big topics, such as mental health and climate change. There are now over two dozen stations located across Canada as well as schools in other countries. <br>Last year, Abhay and Sukhmeet had their first employees, enabling them to d___72___ an app that will act as a social platform to connect Break The Divide stations worldwide. <br>The brothers are happy to find that the organization can play a central role in how youth solve the most d___73___ problems. “I hope that we can be part of creating a world where we are all listening to each other for learning and for change, “says Abhay.<br>",
    "blanks": [
        {
            "blank_id": "68",
            "correct_word": ["ine"],
            "alternatives": []
        },
        {
            "blank_id": "69",
            "correct_word": ["othing"],
            "alternatives": ["so that", "as if", "now that", "even if"]
        },
        {
            "blank_id": "70",
            "correct_word": ["ometowns","omelands"],
            "alternatives": []
        },
        {
            "blank_id": "71",
            "correct_word": ["rovided","repared"],
            "alternatives": []
        },
        {
            "blank_id": "72",
            "correct_word": ["evelop","esign"],
            "alternatives": []
        },
        {
            "blank_id": "73",
            "correct_word": ["ifficult","iscussed"],
            "alternatives": []
        }
    ],
    "info": "【解析】<br>【导语】本文主要介绍了Abhay兄弟创建的一个名为“Break the Divide”的组织，该组织为全世界的青年积极互动交流提供了一个优秀的平台。<br>【67题详解】<br>句意：电话的另一端是Abhay的23岁的哥哥Sukhmete，一名志愿助教。根据“Abhay and a group of his Grade 10 classmates at a secondary school in Canada made their first video call to the Arctic”及首字母提示可知，这里应指电话线的另一端，line意为“电话线”，此处应用单数形式，故填(l)ine。<br>【68题详解】<br>句意：但随着孩子们逐渐适应，聊天变得严肃起来，比如家庭问题、社会问题的故事。根据“such as families issues, stories of social problems”及首字母提示可知，这里是指聊天变得严肃起来，serious意为“严肃的”，形容词在句中作表语，故填(s)erious。<br>【69题详解】<br>句意：一些孩子分享了他们感到多么绝望，因为他们对气候变化带来的危险或威胁无能为力。根据“Some kids shared how hopeless they felt”及首字母提示可知，这里指孩子们对气候变化无能为力，do nothing意为“无能为力”，故填(n)othing。<br>【70题详解】<br>句意：在两个小组都道别后，兄弟俩产生了一个想法：既然谈话旨在扩大学生对家乡以外生活的看法，那就让我们继续下去。根据句中“ broaden the students’ views about life outside…”及首字母提示可知，这里指扩大学生对家乡以外生活的看法，“家乡”可以为(h)ometown/(h)omeland，此处宜用复数，故填(h)ometowns/(h)omelands。<br>【71题详解】<br>句意：他们提供了不同的有用资源，例如开始对话的指导性问题列表，以及视频通话的技术提示。根据“such as a list of guiding questions to get the conversation started, and technical tips for video calls”及首字母提示可知，这里指提供或准备了不同的有用资源，“提供”为provide，“准备”为prepare，结合上下文，此处可用一般过去时，故填(p)rovided/(p)repared。<br>【72题详解】<br>句意：去年，Abhay和Sukhmeet拥有了他们的第一批员工，使他们能够开发一款应用程序，该应用程序将作为一个社交平台，连接世界各地的“Break the Divide”站。根据“an app that will act as a social platform to connect…”及首字母提示可知，这里指开发或设计一款应用程序，“开发”为develop，“设计”为design，动词不定式to后跟动词原形，故填(d)evelop/(d)esign。<br>【73题详解】<br>句意：兄弟俩很高兴地发现，该组织可以在青年如何解决最困难的/讨论最多的问题方面发挥核心作用。根据句中“play a central role in how youth solve the most… problems”可知，这里应指最困难的问题或讨论最多的问题，“困难的”为difficult，“被讨论的”为discussed，故填(d)ifficult/(d)iscussed。<br>",
    "vocabulary_focus": [["ine"], ["othing"], ["ometowns","omelands"], ["rovided","repared"],["evelop","esign"],["ifficult","iscussed"]],
    "library_from": ""
    },    {
        "library_id": "2023nshsjdqzkym16",
        "question_type": "complete",
        "content": "Forest fires happen in summer when it hasn’t rained for a long time and everything is very dry. For many years, people have thought of fires as disasters that ____16____ the forest. The science of fire ecology(生态学) studies the connection between fire, plants, and animals in forest fires. Scientists say that the fire is also an important part of the life ____17____ of a forest. With every fire, the forest is born again.<br>Forest fires often start when lightning strikes a tree, but people can also cause forest fires. Sometimes they don’t know what they did, and it happens by ___18___. But other times it’s done on purpose. Once a fire starts, it ___19___ burns away the dry leaves and branches. The fire also gets rid of overgrown plants, fallen leaves, and bacteria in the soil that cause diseases. Plants on the forest floor receive more space and sunlight to grow, so they can grow and make seeds quickly.<br>When a fire starts in a forest, every creature(动物) tries to ___20___. Birds fly away and mammals usually run away. Small creatures (such as frogs, mice, and insects) hide underground or under rocks.<br>Some of the weaker animals die, but many ____21____. The animals that don’t die in the fire are the strongest. After a fire, some animals that may not be ___22___ to the forest come to feed on the bodies of dead animals. There are lots of things for animals to eat in a burned forest. Animals soon go back to their homes in the forest and plants start growing again.<br>Now, according to fire ecology studies, it’s possible for people to see forest fires as natural ___23___. Hundreds of species of plants and animals live together in forests.<br>",
        "blanks": [
            {
                "blank_id": "16",
                "correct_word": [
                    "harm"
                ],
                "alternatives": [
                    "accident",
                    "seriously",
                    "harm",
                    "actually",
                    "cycle"
                ]
            },
            {
                "blank_id": "17",
                "correct_word": [
                    "cycle"
                ],
                "alternatives": [
                    "accident",
                    "seriously",
                    "harm",
                    "actually",
                    "cycle"
                ]
            },
            {
                "blank_id": "18",
                "correct_word": [
                    "accident"
                ],
                "alternatives": [
                    "accident",
                    "seriously",
                    "harm",
                    "actually",
                    "cycle"
                ]
            },
            {
                "blank_id": "19",
                "correct_word": [
                    "actually"
                ],
                "alternatives": [
                    "accident",
                    "seriously",
                    "harm",
                    "actually",
                    "cycle"
                ]
            },
            {
                "blank_id": "20",
                "correct_word": [
                    "escape"
                ],
                "alternatives": [
                    "survive",
                    "native",
                    "expect",
                    "wonders",
                    "escape"
                ]
            },
            {
                "blank_id": "21",
                "correct_word": [
                    "survive"
                ],
                "alternatives": [
                    "survive",
                    "native",
                    "expect",
                    "wonders",
                    "escape"
                ]
            },
            {
                "blank_id": "22",
                "correct_word": [
                    "native"
                ],
                "alternatives": [
                    "survive",
                    "native",
                    "expect",
                    "wonders",
                    "escape"
                ]
            },
            {
                "blank_id": "23",
                "correct_word": [
                    "wonders"
                ],
                "alternatives": [
                    "survive",
                    "native",
                    "expect",
                    "wonders",
                    "escape"
                ]
            }
        ],
        "info": "<br>【导语】本文是一篇说明文，主要介绍火灾是森林生命周期的重要组成部分。<br>16题详解】<br>句意：多年来，人们一直认为火灾是危害森林的灾难。结合“For many years, people have thought of fires as disasters that...the forest.”和备选词汇可知，灾难会危害森林，动词harm“伤害”符合语境。故选C。<br>【17题详解】<br>句意：科学家表示，火灾也是森林生命周期的重要组成部分。根据后文“With every fire, the forest is born again.”可知，每一场大火，森林都会重生，所以火灾也是森林生命周期的重要组成部分，cycle“周期”符合语境。故选E。<br>【18题详解】<br>句意：有时他们不知道自己做了什么，这是偶然发生的。by accident“偶然”，故选A。<br>【19题详解】<br>句意：一旦发生火灾，它实际上会把干燥的树叶和树枝都烧掉。根据“Once a fire starts, it…burns away the dry leaves and branches.”可知，大火实际上会把干燥的树叶和树枝都烧掉，副词actually“实际上”符合语境。故选D。<br>【20题详解】<br>句意：当森林里发生火灾时，所有的动物都试图逃跑。根据“Birds fly away and mammals usually run away. Small creatures (such as frogs, mice, and insects) hide underground or under rocks.”可知，动物会逃离，escape“逃跑”符合语境。故选E。<br>【21题详解】<br>句意：一些较弱的动物会死亡，但许多动物会幸存下来。结合“Some of the weaker animals die, but many...”和备选词汇可知，but表转折，由此可知一些动物死亡，一些动物幸存，survive“幸存”符合语境。故选A。<br>【22题详解】<br>句意：火灾发生后，一些可能不是森林原生的动物来以动物尸体为食。结合“some animals that may not be...to the forest...”和备选词汇可知，此处应用be native to“源于……的”，形容词native作表语。故选B。<br>【23题详解】<br>句意：现在，根据火灾生态学研究，人们有可能将森林火灾视为自然奇观。根据“it’s possible for people to see forest fires as natural...”和备选词汇可知，此处指将森林火灾视为自然奇观，名词wonders“奇观”符合语境。故选D。<br>",
        "vocabulary_focus": [
            [
                "harm"
            ],
            [
                "cycle"
            ],
            [
                "accident"
            ],
            [
                "actually"
            ],
            [
                "escape"
            ],
            [
                "survive"
            ],
            [
                "native"
            ],
            [
                "wonders"
            ]
        ],
        "library_from": "2023年上海市嘉定区中考一模"
    }
]